Todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-13 Tue 15:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Django Software As A Service Project Starter Template</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="unknown" />
</head>
<body>
<div id="content">
<h1 class="title">Django Software As A Service Project Starter Template</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd2eb10e">1. SaaS Definition</a>
<ul>
<li><a href="#org290dc74">1.1. Target Project Attributes</a></li>
</ul>
</li>
<li><a href="#org588f62b">2. Implementing the SaaS</a>
<ul>
<li><a href="#org0eb2365">2.1. Prospective Technologies and Frameworks</a>
<ul>
<li><a href="#orgb3f1257">2.1.1. <span class="todo TODO">TODO</span> Data and Database Layer</a></li>
<li><a href="#org6ab2132">2.1.2. <span class="todo TODO">TODO</span> Backend Controller</a></li>
<li><a href="#org2b89035">2.1.3. <span class="todo TODO">TODO</span> Frontend View</a></li>
</ul>
</li>
<li><a href="#org54381f2">2.2. Django Framework</a>
<ul>
<li><a href="#orgd4be3bb">2.2.1. Modules</a></li>
<li><a href="#org6648d9e">2.2.2. Features Todo</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org17db51d">3. Deployment, CI/CD</a>
<ul>
<li><a href="#org350ac49">3.1. <span class="todo TODO">TODO</span> Travis CI</a></li>
<li><a href="#orgd4f816f">3.2. <span class="todo TODO">TODO</span> Gitlab Autodevops</a></li>
<li><a href="#org372dad4">3.3. <span class="todo TODO">TODO</span> Docker</a></li>
<li><a href="#org7f8051d">3.4. <span class="todo TODO">TODO</span> Heroku</a></li>
<li><a href="#orge098a42">3.5. <span class="todo TODO">TODO</span> AWS cloud</a></li>
<li><a href="#org94b69ee">3.6. <span class="todo TODO">TODO</span> Google Cloud</a></li>
<li><a href="#org4846c22">3.7. <span class="todo TODO">TODO</span> PyPi</a></li>
<li><a href="#org80c149f">3.8. <span class="todo TODO">TODO</span> Jenkins</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd2eb10e" class="outline-2">
<h2 id="orgd2eb10e"><span class="section-number-2">1</span> SaaS Definition</h2>
<div class="outline-text-2" id="text-1">
<p>
  A software as a service, offering some software online as a paid service.
Income generating software. 
  A project supporting user management, subscriptions, payments methods,
Per User Data CRUD, isolated db and runtime environments, 3rd party integrations.
</p>

<p>
An Intuitive, Modern, Responsive UX, User Friendliness.
Easy Deployment, Testing, Extensibility, Modularity, OS independent
</p>
</div>
<div id="outline-container-org290dc74" class="outline-3">
<h3 id="org290dc74"><span class="section-number-3">1.1</span> Target Project Attributes</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Easy Deployment</li>
<li>Automated Testing and CI</li>
<li>Estensible</li>
<li>Modular</li>
<li>OS Independent</li>
<li>Multiple Data Storage Technologies Support</li>
<li>3rd Party Services Integrations</li>
<li>Data Analytics and Usage Stats</li>
<li>User Friendly, Intuitive, Sleek, Modern, Responsive</li>
<li>Data Driven, Reactive</li>
<li>Asynchronous, Realtime</li>
<li>Multi-Language Support, Internalization</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org588f62b" class="outline-2">
<h2 id="org588f62b"><span class="section-number-2">2</span> Implementing the SaaS</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0eb2365" class="outline-3">
<h3 id="org0eb2365"><span class="section-number-3">2.1</span> Prospective Technologies and Frameworks</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgb3f1257" class="outline-4">
<h4 id="orgb3f1257"><span class="section-number-4">2.1.1</span> <span class="todo TODO">TODO</span> Data and Database Layer</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Sqlite3</li>
<li>MySQL</li>
<li>PostgreSQL</li>
<li>MongoDB</li>
<li>NoSQL</li>
<li>Amazon s3 buckets</li>
<li>Google Cloud Firebase</li>
</ul>
</div>
</div>
<div id="outline-container-org6ab2132" class="outline-4">
<h4 id="org6ab2132"><span class="section-number-4">2.1.2</span> <span class="todo TODO">TODO</span> Backend Controller</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Django</li>
<li>Flask</li>
<li>Laravel</li>
<li>Nodejs</li>
</ul>
</div>
</div>
<div id="outline-container-org2b89035" class="outline-4">
<h4 id="org2b89035"><span class="section-number-4">2.1.3</span> <span class="todo TODO">TODO</span> Frontend View</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>Jinja2 templates</li>
<li>React.js</li>
<li>Vue.js</li>
<li>Angular.js</li>
<li>Bootstrap</li>
<li>Font-Awesome</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org54381f2" class="outline-3">
<h3 id="org54381f2"><span class="section-number-3">2.2</span> Django Framework</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgd4be3bb" class="outline-4">
<h4 id="orgd4be3bb"><span class="section-number-4">2.2.1</span> Modules</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li>django-allauth</li>
</ol>
<ol class="org-ol">
<li>django-social</li>
<li>django-stripe</li>
<li>django-heroku</li>
<li>django-multitenants
<ol class="org-ol">
<li>django-rest-framework</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org6648d9e" class="outline-4">
<h4 id="org6648d9e"><span class="section-number-4">2.2.2</span> Features Todo</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ol class="org-ol">
<li><a id="orgfe709ec"></a><span class="todo TODO">TODO</span> Django Authentication, Social register<br /></li>
<li><a id="org3d0decf"></a><span class="todo TODO">TODO</span> Django Multitenancy Support<br /></li>
<li><a id="org5cc056f"></a><span class="todo TODO">TODO</span> Django Models<br /></li>
<li><a id="org05f32b6"></a><span class="todo TODO">TODO</span> Django Views<br /></li>
<li><a id="org35feb82"></a><span class="todo TODO">TODO</span> A Rest API<br /></li>
<li><a id="org0b810b1"></a><span class="todo TODO">TODO</span> Django Routing and Urls<br /></li>
<li><a id="orge67c728"></a><span class="todo TODO">TODO</span> Django Templates<br /></li>
<li><a id="org58bd38c"></a><span class="todo TODO">TODO</span> Django Settings Config<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org17db51d" class="outline-2">
<h2 id="org17db51d"><span class="section-number-2">3</span> Deployment, CI/CD</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org350ac49" class="outline-3">
<h3 id="org350ac49"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> Travis CI</h3>
</div>
<div id="outline-container-orgd4f816f" class="outline-3">
<h3 id="orgd4f816f"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Gitlab Autodevops</h3>
</div>
<div id="outline-container-org372dad4" class="outline-3">
<h3 id="org372dad4"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> Docker</h3>
</div>
<div id="outline-container-org7f8051d" class="outline-3">
<h3 id="org7f8051d"><span class="section-number-3">3.4</span> <span class="todo TODO">TODO</span> Heroku</h3>
</div>
<div id="outline-container-orge098a42" class="outline-3">
<h3 id="orge098a42"><span class="section-number-3">3.5</span> <span class="todo TODO">TODO</span> AWS cloud</h3>
</div>
<div id="outline-container-org94b69ee" class="outline-3">
<h3 id="org94b69ee"><span class="section-number-3">3.6</span> <span class="todo TODO">TODO</span> Google Cloud</h3>
</div>
<div id="outline-container-org4846c22" class="outline-3">
<h3 id="org4846c22"><span class="section-number-3">3.7</span> <span class="todo TODO">TODO</span> PyPi</h3>
</div>
<div id="outline-container-org80c149f" class="outline-3">
<h3 id="org80c149f"><span class="section-number-3">3.8</span> <span class="todo TODO">TODO</span> Jenkins</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: unknown</p>
<p class="date">Created: 2019-08-13 Tue 15:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
